Tekla.Structures.ModelInternal.dotBoltPolygon_t
Serialization structure for Bolt Polygon.

Tekla.Structures.ModelInternal.dotBoltPolygon_t.nPoints
Number of cornerpoints in bolt polygon.

Tekla.Structures.ModelInternal.dotBoltPolygon_t.aX
The x-coordinates of all points.

Tekla.Structures.ModelInternal.dotBoltPolygon_t.aY
The y-coordinates of all points.

Tekla.Structures.ModelInternal.dotBoltPolygon_t.aZ
The z-coordinates of all points.

Tekla.Structures.ModelInternal.dotBoltPolygon_t.#ctor(System.Int32)
Instantiates a bolt polygon structure with given arguments.
Size: Number of points in bolt polygon.

Tekla.Structures.ModelInternal.dotBoltPolygon_t.GetPoints
Get bolt polygon points in ArrayList.
Returns: ArrayList of bolt polygon Points